/*-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-

    グローバルデータ

  -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-*/
loading(path + "data/species.json", load_species);
loading(path + "data/action.json", load_actions);
/*-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-*/



/*-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
 
    中央処理
 
  -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-*/
phina.main(function ()
{
  var app = GameApp({
    //画面サイズ設定
    width: SCREEN_W,
    height: SCREEN_H,
    fit: true,

    //アセット読み込み
    // assets: ASSETS,

    //fps設定
    fps: 60,

    // startLabel: "タイトル",
    startLabel: "戦闘",
    scenes:
      [
        // {
        //   label: "タイトル",
        //   className: "Title_scene",
        // },
        {
          label: "メイン",
          className: "Main_scene",
        },
        {
          label: "戦闘",
          className: "Battle_scene",
        }
      ]
  });
  app.run();
});
/*-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-*/

